<details><summary>Show Plan</summary>

```

terraform
data.github_release.latest_release: Reading...
module.tenant_database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.tenant_database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=XMMGgQ]
data.assert_test.workspace: Reading...
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
data.assert_test.workspace: Read complete after 0s
data.github_release.latest_release: Read complete after 0s [id=84236701]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/511c1c1e-eace-4166-b7c1-9bbfc82c70f6]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.tenant_database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0893b0725fecf5012]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
module.database_cluster.data.aws_partition.current: Reading...
module.tenant_database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-tenant-database-1]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.tenant_database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-tenant-database]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.data.aws_caller_identity.current: Reading...
module.tenant_database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-2061342958]
module.ecs.data.aws_caller_identity.current: Read complete after 1s [id=898587786287]
module.tenant_database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-tenant-database]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z04987691W18X63LDNXVM]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z04987691W18X63LDNXVM__9407f2eddc416d7cd8c8ee599f0a5c6a.staging.echo.walletconnect.com._CNAME]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z04987691W18X63LDNXVM_staging.echo.walletconnect.com_A]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_secretsmanager_secret.ghcr_authentication will be created
  + resource "aws_secretsmanager_secret" "ghcr_authentication" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "staging-push-ghcr-auth"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.ecs.data.aws_iam_policy_document.fetch_ghcr_secret will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "fetch_ghcr_secret" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "secretsmanager:GetSecretValue",
              + "ssm:GetParameters",
            ]
          + resources = (sensitive value)
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:13" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:13" -> (known after apply)
      ~ container_definitions    = (sensitive value) -> (sensitive value) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 13 -> (known after apply)
      - tags                     = {} -> null
      - task_role_arn            = "" -> null
        # (8 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_iam_policy.fetch_ghcr_secret will be created
  + resource "aws_iam_policy" "fetch_ghcr_secret" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "staging-push-fetch-ghcr-secret"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_fetch_ghcr_secret_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-push-ecs-task-execution-role"
    }

  # module.tenant_database_cluster.aws_db_subnet_group.this[0] will be destroyed
  # (because aws_db_subnet_group.this is not in configuration)
  - resource "aws_db_subnet_group" "this" {
      - arn                     = "arn:aws:rds:eu-central-1:898587786287:subgrp:staging-push-tenant-database" -> null
      - description             = "For Aurora cluster staging-push-tenant-database" -> null
      - id                      = "staging-push-tenant-database" -> null
      - name                    = "staging-push-tenant-database" -> null
      - subnet_ids              = [
          - "subnet-00c3da4dd2356a722",
          - "subnet-0237d5132685aec74",
          - "subnet-0dabd56e1ee9f13d5",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {} -> null
      - tags_all                = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "push"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be destroyed
  # (because aws_rds_cluster.this is not in configuration)
  - resource "aws_rds_cluster" "this" {
      - allocated_storage                   = 1 -> null
      - allow_major_version_upgrade         = true -> null
      - apply_immediately                   = true -> null
      - arn                                 = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-push-tenant-database" -> null
      - availability_zones                  = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> null
      - backtrack_window                    = 0 -> null
      - backup_retention_period             = 7 -> null
      - cluster_identifier                  = "staging-push-tenant-database" -> null
      - cluster_members                     = [
          - "staging-push-tenant-database-1",
        ] -> null
      - cluster_resource_id                 = "cluster-NWAO7AMOLN6WJ2CALJG4WHE45A" -> null
      - copy_tags_to_snapshot               = false -> null
      - database_name                       = "postgres" -> null
      - db_cluster_instance_class           = "" -> null
      - db_cluster_parameter_group_name     = "default.aurora-postgresql13" -> null
      - db_subnet_group_name                = "staging-push-tenant-database" -> null
      - deletion_protection                 = false -> null
      - enable_global_write_forwarding      = false -> null
      - enable_http_endpoint                = false -> null
      - enabled_cloudwatch_logs_exports     = [] -> null
      - endpoint                            = "staging-push-tenant-database.cluster-cnkvjbadm57i.eu-central-1.rds.amazonaws.com" -> null
      - engine                              = "aurora-postgresql" -> null
      - engine_mode                         = "provisioned" -> null
      - engine_version                      = "13.6" -> null
      - engine_version_actual               = "13.6" -> null
      - final_snapshot_identifier           = "final-staging-push-tenant-database-5cc30681" -> null
      - global_cluster_identifier           = "" -> null
      - hosted_zone_id                      = "Z1RLNUO7B9Q6NB" -> null
      - iam_database_authentication_enabled = false -> null
      - iam_roles                           = [] -> null
      - id                                  = "staging-push-tenant-database" -> null
      - iops                                = 0 -> null
      - kms_key_id                          = "arn:aws:kms:eu-central-1:898587786287:key/8807d3bb-5005-48c3-bc18-fe5c1a8a7279" -> null
      - master_password                     = (sensitive value)
      - master_username                     = "root" -> null
      - network_type                        = "IPV4" -> null
      - port                                = 5432 -> null
      - preferred_backup_window             = "02:00-03:00" -> null
      - preferred_maintenance_window        = "sun:05:00-sun:06:00" -> null
      - reader_endpoint                     = "staging-push-tenant-database.cluster-ro-cnkvjbadm57i.eu-central-1.rds.amazonaws.com" -> null
      - replication_source_identifier       = "" -> null
      - skip_final_snapshot                 = false -> null
      - storage_encrypted                   = true -> null
      - storage_type                        = "" -> null
      - tags                                = {} -> null
      - tags_all                            = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "push"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_security_group_ids              = [
          - "sg-0893b0725fecf5012",
        ] -> null

      - serverlessv2_scaling_configuration {
          - max_capacity = 10 -> null
          - min_capacity = 2 -> null
        }

      - timeouts {}
    }

  # module.tenant_database_cluster.aws_rds_cluster_instance.this["1"] will be destroyed
  # (because aws_rds_cluster_instance.this is not in configuration)
  - resource "aws_rds_cluster_instance" "this" {
      - apply_immediately                     = true -> null
      - arn                                   = "arn:aws:rds:eu-central-1:898587786287:db:staging-push-tenant-database-1" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "eu-central-1c" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - cluster_identifier                    = "staging-push-tenant-database" -> null
      - copy_tags_to_snapshot                 = false -> null
      - db_parameter_group_name               = "default.aurora-postgresql13" -> null
      - db_subnet_group_name                  = "staging-push-tenant-database" -> null
      - dbi_resource_id                       = "db-V3WFORBFBENNUTO6ZQ6AU2SHHA" -> null
      - endpoint                              = "staging-push-tenant-database-1.cnkvjbadm57i.eu-central-1.rds.amazonaws.com" -> null
      - engine                                = "aurora-postgresql" -> null
      - engine_version                        = "13.6" -> null
      - engine_version_actual                 = "13.6" -> null
      - id                                    = "staging-push-tenant-database-1" -> null
      - identifier                            = "staging-push-tenant-database-1" -> null
      - instance_class                        = "db.serverless" -> null
      - kms_key_id                            = "arn:aws:kms:eu-central-1:898587786287:key/8807d3bb-5005-48c3-bc18-fe5c1a8a7279" -> null
      - monitoring_interval                   = 0 -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - preferred_backup_window               = "02:00-03:00" -> null
      - preferred_maintenance_window          = "sun:05:00-sun:06:00" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "push"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - writer                                = true -> null

      - timeouts {}
    }

  # module.tenant_database_cluster.aws_security_group.this[0] will be destroyed
  # (because aws_security_group.this is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0893b0725fecf5012" -> null
      - description            = "Control traffic to/from RDS Aurora staging-push-tenant-database" -> null
      - egress                 = [] -> null
      - id                     = "sg-0893b0725fecf5012" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "From allowed CIDRs"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "staging-push-tenant-database-20221104144507770100000001" -> null
      - name_prefix            = "staging-push-tenant-database-" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "staging-push-tenant-database"
        } -> null
      - tags_all               = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "staging-push-tenant-database"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-03d2024cd76f87de7" -> null
    }

  # module.tenant_database_cluster.aws_security_group_rule.cidr_ingress[0] will be destroyed
  # (because aws_security_group_rule.cidr_ingress is not in configuration)
  - resource "aws_security_group_rule" "cidr_ingress" {
      - cidr_blocks            = [
          - "10.0.0.0/16",
        ] -> null
      - description            = "From allowed CIDRs" -> null
      - from_port              = 5432 -> null
      - id                     = "sgrule-2061342958" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0893b0725fecf5012" -> null
      - security_group_rule_id = "sgr-032d3fa83a996a912" -> null
      - self                   = false -> null
      - to_port                = 5432 -> null
      - type                   = "ingress" -> null
    }

  # module.tenant_database_cluster.random_id.snapshot_identifier[0] will be destroyed
  # (because random_id.snapshot_identifier is not in configuration)
  - resource "random_id" "snapshot_identifier" {
      - b64_std     = "XMMGgQ==" -> null
      - b64_url     = "XMMGgQ" -> null
      - byte_length = 4 -> null
      - dec         = "1556285057" -> null
      - hex         = "5cc30681" -> null
      - id          = "XMMGgQ" -> null
      - keepers     = {
          - "id" = "staging-push-tenant-database"
        } -> null
    }

  # module.tenant_database_cluster.random_password.master_password[0] will be destroyed
  # (because random_password.master_password is not in configuration)
  - resource "random_password" "master_password" {
      - bcrypt_hash = (sensitive value)
      - id          = "none" -> null
      - length      = 10 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

Plan: 4 to add, 1 to change, 8 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*